/* eslint-disable react/display-name */
/* eslint-disable react/no-children-prop */

import Head from "next/head"
import {
  Box,
  Flex,
  Text,
  Spacer,
  useBreakpointValue,
  LinkBox,
  LinkOverlay,
} from "@chakra-ui/react"
import Toolbar from "../../../components/Toolbar"
import { useRouter } from "next/router"
import NextLink from "next/link"

const Report = () => {
  const hasSpacer = useBreakpointValue({ base: false, md: true })

  return (
    <Box>
      <Head>
        <title>Report</title>
        <meta name="description" content="report" />
        <link rel="icon" href="/favicon.ico" />
      </Head>
      <Box>
        <Flex flexDirection="column" p="2">
          <Toolbar title="รายงาน" showSearchInput={false} />
        </Flex>
        <Flex
          flexWrap="wrap"
          width="100%"
          pr={{ base: 0, md: 12 }}
          mb={{ base: 0, md: 10 }}
          alignItems="center"
          justifyContent="center"
        >
          <LinkBox
            height="200px"
            width={{ base: "90%", md: "30%" }}
            bgColor="#F5F5F5"
            border="1px solid #B2CCCC"
            display="flex"
            flexDirection="column"
            alignItems="center"
            justifyContent="center"
            mb={{ base: 4, md: 0 }}
            cursor="pointer"
            borderRadius="6px"
          >
            <svg
              width="80"
              height="80"
              viewBox="0 0 80 80"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g clipPath="url(#clip0)">
                <path
                  d="M33.3327 16.6663C18.5993 16.6663 6.66602 18.333 6.66602 29.9997V63.333C6.66602 66.1663 7.89935 68.8663 9.99935 70.733V76.6663C9.99935 78.4997 11.4993 79.9997 13.3327 79.9997H16.666C18.4993 79.9997 19.9993 78.4997 19.9993 76.6663V73.333H46.666V76.6663C46.666 78.4997 48.166 79.9997 49.9994 79.9997H53.3327C55.166 79.9997 56.666 78.4997 56.666 76.6663V70.733C58.766 68.8663 59.9994 66.1663 59.9994 63.333V29.9997C59.9994 18.333 48.066 16.6663 33.3327 16.6663ZM18.3327 66.6663C15.566 66.6663 13.3327 64.433 13.3327 61.6663C13.3327 58.8997 15.566 56.6663 18.3327 56.6663C21.0993 56.6663 23.3327 58.8997 23.3327 61.6663C23.3327 64.433 21.0993 66.6663 18.3327 66.6663ZM48.3327 66.6663C45.566 66.6663 43.3327 64.433 43.3327 61.6663C43.3327 58.8997 45.566 56.6663 48.3327 56.6663C51.0993 56.6663 53.3327 58.8997 53.3327 61.6663C53.3327 64.433 51.0993 66.6663 48.3327 66.6663ZM53.3327 46.6663H13.3327V29.9997H53.3327V46.6663ZM73.3327 16.6663V49.9997C73.3327 52.833 72.0993 55.533 69.9994 57.3997V63.333C69.9994 65.1663 68.4994 66.6663 66.666 66.6663H66.266C66.4993 65.5997 66.666 64.4997 66.666 63.333V29.9997C66.666 9.99967 43.3327 9.99967 33.3327 9.99967C30.2994 9.99967 25.9993 9.99968 21.5327 10.5663C25.166 4.39967 34.9993 3.33301 46.666 3.33301C61.3994 3.33301 73.3327 4.99967 73.3327 16.6663Z"
                  fill="#00A5A8"
                />
              </g>
              <defs>
                <clipPath id="clip0">
                  <rect width="80" height="80" fill="white" />
                </clipPath>
              </defs>
            </svg>
            <NextLink href="/employee/reports/summaryBookingResult" passHref>
              <LinkOverlay>
                <Text
                  fontSize="20px"
                  fontWeight={600}
                  color="primary.500"
                  mt={8}
                >
                  สรุปการจัดรถ
                </Text>
              </LinkOverlay>
            </NextLink>
          </LinkBox>
          {hasSpacer && <Spacer />}
          <LinkBox
            height="200px"
            width={{ base: "90%", md: "30%" }}
            bgColor="#F5F5F5"
            border="1px solid #B2CCCC"
            display="flex"
            flexDirection="column"
            alignItems="center"
            justifyContent="center"
            mb={{ base: 4, md: 0 }}
            cursor="pointer"
            borderRadius="6px"
          >
            <svg
              width="80"
              height="80"
              viewBox="0 0 80 80"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M52.0007 10.333V24.4997L61.534 30.133L59.034 34.1997L47.0007 26.9997V10.333H52.0007ZM50.334 40.333C54.8673 40.333 58.8007 38.6663 62.0007 35.433C65.334 32.1997 67.0007 28.2997 67.0007 23.6663C67.0007 19.133 65.334 15.1997 62.0007 11.9997C58.8007 8.66634 54.8673 6.99968 50.334 6.99968C45.7007 6.99968 41.8007 8.66634 38.5673 11.9997C35.334 15.1997 33.6673 19.133 33.6673 23.6663C33.6673 28.2997 35.334 32.1997 38.5673 35.433C41.8007 38.6663 45.7007 40.333 50.334 40.333ZM42.0007 60.333C43.4673 60.333 44.6673 59.7997 45.6007 58.7997C46.534 57.7997 47.0007 56.633 47.0007 55.333C47.0007 53.933 46.534 52.7663 45.6007 51.7663C44.6673 50.7663 43.4673 50.333 42.0007 50.333C40.534 50.333 39.334 50.7663 38.4007 51.7663C37.4673 52.7663 37.0007 53.933 37.0007 55.333C37.0007 56.633 37.4673 57.7997 38.4007 58.7997C39.334 59.7997 40.534 60.333 42.0007 60.333ZM7.00065 40.333H34.034C29.334 35.7997 27.0007 30.333 27.0007 23.6663H7.00065V40.333ZM12.0007 60.333C13.4673 60.333 14.6673 59.7997 15.6007 58.7997C16.534 57.7997 17.0007 56.633 17.0007 55.333C17.0007 53.933 16.534 52.7663 15.6007 51.7663C14.6673 50.7663 13.4673 50.333 12.0007 50.333C10.534 50.333 9.33399 50.7663 8.40065 51.7663C7.46732 52.7663 7.00065 53.933 7.00065 55.333C7.00065 56.633 7.46732 57.7997 8.40065 58.7997C9.33399 59.7997 10.534 60.333 12.0007 60.333ZM50.334 0.333008C56.734 0.333008 62.2673 2.56634 66.834 7.16634C71.434 11.733 73.6673 17.2663 73.6673 23.6663C73.6673 29.5663 71.8007 34.633 67.934 38.9663C64.1007 43.2663 59.334 45.8663 53.6673 46.6997V56.9997C53.6673 59.7997 52.5673 62.2664 50.334 64.333V70.333C50.334 71.233 49.9673 71.9997 49.334 72.6997C48.6673 73.3663 47.934 73.6663 47.0007 73.6663H43.6673C42.7673 73.6663 42.0007 73.3663 41.3007 72.6997C40.989 72.3902 40.7428 72.0212 40.5767 71.6146C40.4107 71.208 40.3281 70.7722 40.334 70.333V66.9997H13.6673V70.333C13.6673 71.233 13.3673 71.9997 12.7007 72.6997C12.0007 73.3663 11.234 73.6663 10.334 73.6663H7.00065C6.06732 73.6663 5.33398 73.3663 4.66732 72.6997C4.03398 71.9997 3.66732 71.233 3.66732 70.333V64.333C1.43398 62.2664 0.333984 59.7997 0.333984 56.9997V23.6663C0.333984 18.3997 2.56732 14.833 7.16732 12.9997C11.734 11.1997 18.3673 10.333 27.0007 10.333H29.034C29.9673 10.333 30.634 10.433 31.0673 10.433C35.7673 3.66634 42.1673 0.333008 50.334 0.333008Z"
                fill="#00A5A8"
              />
            </svg>

            <NextLink href="/employee/reports/daily" passHref>
              <LinkOverlay>
                <Text
                  fontSize="20px"
                  fontWeight={600}
                  color="primary.500"
                  mt={8}
                >
                  ตารางรถรับส่งประจำวัน
                </Text>
              </LinkOverlay>
            </NextLink>
          </LinkBox>
          {hasSpacer && <Spacer />}
          {hasSpacer && <Spacer />}
          {hasSpacer && <Spacer />}
          {hasSpacer && <Spacer />}
          {hasSpacer && <Spacer />}
          {hasSpacer && <Spacer />}
          {hasSpacer && <Spacer />}
        </Flex>
      </Box>
    </Box>
  )
}

export default Report
